{
	"experience": [
		{
			"id": "vpl",
			"title": "Intermediate Software Developer",
			"organization": "Vox Pop Labs",
			"location": "Remote",
			"startDate": "Jan 2024",
			"endDate": "March 2025",
			"description": {
				"summary": "Internationally expanded reach of survey election tool to over 3 million users by building a Solid.js and TypeScript application, enabling content in multiple languages and compliance with local regulations, including WCAG 2.1 and WAI-ARIA:",
				"list": [
					"Independently engineered the front-end architecture using Solid.js and TypeScript, leveraging Solid’s fine-grained reactivity model to minimize re-renders and ensure a responsive, performant user experience.",
					"Designed and built a fully-typed, themeable design system using TailwindCSS, enabling customization across localized editions, reducing code duplication, and accelerating feature iteration.",
					"Built a localization pipeline using open-source tooling and custom scripts to manage dynamic content switching and locale-aware formatting to support international users and election-specific variations.",
					"Led accessibility efforts to implement WCAG 2.1 and WAI-ARIA standards, ensuring keyboard-navigable components and conducting audits with tools like Axe, Lighthouse, and manual screen reader testing resulting in improved accessibility scores."
				]
			},
			"skills": ["React", "TypeScript", "GraphQL", "Jest"]
		},
		{
			"id": "pilot",
			"title": "Software Developer",
			"organization": "Pilot Interactive Inc.",
			"location": "Remote",
			"startDate": "Jul 2023",
			"endDate": "Dec 2023",
			"description": {
				"list": [
					"Handled large volumes of data from multiple sources by optimizing API calls, implementing pagination, and using lazy loading, ensuring the application remained responsive even with heavy data load.",
					"Built accessible form components with proper focus management, keyboard navigation, and error handling to ensure compliance with WCAG 2.1, improving usability for users with disabilities.",
					"Facilitated cross-functional collaboration through regular syncs and async updates, ensuring alignment across design, front-end, and back-end teams, and minimizing rework caused by miscommunication.",
					"Utilized JavaScript and Solid.js to build front-end components, applying Solid.js’s fine-grained reactivity to deliver real-time updates and maintain high-performance even with complex, data-heavy components.",
					"Integrated third-party APIs, such as Google API, into the application, implementing caching strategies to optimize data retrieval, reduce API calls, and enhance overall user experience."
				]
			},
			"skills": [
				"SolidJS",
				"JavaScript",
				"API Testing",
				"WCAG",
				"Data Caching",
				"TypeScript",
				"TailwindCSS"
			]
		},
		{
			"id": "freelance",
			"title": "Web Developer",
			"organization": "Freelance",
			"location": "Remote",
			"startDate": "Sept 2021",
			"endDate": "Sept 2023",
			"description": {
				"list": [
					"Collaborated with the clients to develop visually appealing website mock-ups, ensuring client satisfaction and aligning project objectives before entering the development phase.",
					"Utilized HTML5, CSS3, and JavaScript to create engaging front-end web pages that captivated users and delivered seamless browsing experiences.",
					"Implemented websites and landing pages from concept to deployment, leveraging technical expertise to bring designs to life and meet project goals.",
					"Demonstrated meticulous attention to detail in planning, writing, and debugging web applications, ensuring accurate and reliable functionality.",
					"Introduced a responsive, mobile-first approach to standardize output, enhancing user experiences across devices and promoting accessibility."
				]
			},
			"skills": [
				"HTML",
				"CSS",
				"JavaScript",
				"Next.js",
				"TailwindCSS",
				"React",
				"Material UI",
				"Node.js",
				"Shopify",
				"WordPress"
			]
		}
	],
	"education": [],
	"certifications": [],
	"oss": [
		{
			"id": "solid-oss",
			"repository": "solidjs/solid-docs",
			"description": "Led the overhaul of documentation, conducting a comprehensive audit to identify gaps and areas of improvement, and restructuring content for better clarity, accuracy, and user experience.",
			"contributionType": "Maintainer",
			"link": "https://github.com/solidjs/solid-docs"
		},
		{
			"id": "global-chem",
			"repository": "Global-Chem/global-chem-website",
			"description": "Led the development of scalable React applications, mentoring contributors and transforming complex chemical data into intuitive, accessible user interfaces.",
			"contributionType": "Contributor",
			"link": "https://github.com/Global-Chem/global-chem-website"
		},
		{
			"id": "accessible-for-all",
			"repository": "AccessibleForAll/AccessibleWebDev",
			"description": "Collaborated with diverse contributors to create plain-language, example-rich articles on web accessibility for developers and designers, while also helping redesign and implement a more user-friendly, responsive website aligned with project owners' vision.",
			"contributionType": "Contributor",
			"link": "https://github.com/AccessibleForAll/AccessibleWebDev"
		},
		{
			"id": "mui",
			"repository": "mui/material-ui",
			"description": "Contributed to high-quality technical documentation by collaborating with developers, revising content for clarity and consistency, incorporating feedback, and providing code examples, resulting in improved usability and recognition for impactful contributions.",
			"contributionType": "Contributor",
			"link": "https://github.com/mui/material-ui"
		}
	]
}
